app/controllers/tweeps_controller.rb

  def index
   @ob={}
    @ob['p']=0
    @ob['n']=0
    @ob['ne']=0
    @tweeps = Tweep.all
---
SELECT  "tweeps".* FROM "tweeps" ORDER BY "tweeps"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def create
    @tweep = Tweep.new(tweep_params)

    respond_to do |format|
      if @tweep.save
---
INSERT INTO "tweeps" ("query", "created_at", "updated_at") VALUES (?, ?, ?)  [["query", "donald"], ["created_at", "2018-07-06 16:41:01.730425"], ["updated_at", "2018-07-06 16:41:01.730425"]]

  def destroy
    @tweep.destroy
---
DELETE FROM "tweeps" WHERE "tweeps"."id" = ?  [["id", 2]]

    def set_tweep
      @tweep = Tweep.find(params[:id])
---
SELECT  "tweeps".* FROM "tweeps" WHERE "tweeps"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]